CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
#include "ap6256_driver.h"

#include "ap6256_assets.h"
#include "test_uart.h"
#include "stm32h7xx_ll_sdmmc.h"

#include <stdbool.h>
#include <stddef.h>
#include <string.h>

#define AP6256_WL_ENABLE_PORT GPIOC
#define AP6256_WL_ENABLE_PIN  GPIO_PIN_7
#define AP6256_BT_ENABLE_PORT GPIOD
#define AP6256_BT_ENABLE_PIN  GPIO_PIN_13

#define AP6256_POWER_SETTLE_MS     120U
#define AP6256_SDIO_READY_TIMEOUT  500U
#define AP6256_SDIO_CMD_TIMEOUT    120U
#define AP6256_BT_EVENT_TIMEOUT    350U
#define AP6256_CMD52_RETRIES       8U
#define AP6256_SDIO_FUNC_READY_TIMEOUT 200U
#define AP6256_SDIO_DATA_TIMEOUT_MS    250U

#define AP6256_SDIO_CCCR_SDIO_REV  0x01U
#define AP6256_SDIO_CCCR_IO_ENABLE 0x02U
#define AP6256_SDIO_CCCR_IO_READY  0x03U

#define AP6256_SDIO_FBR_STRIDE          0x100U
#define AP6256_SDIO_FBR_BLOCK_SIZE_LOW  0x10U
#define AP6256_SDIO_FBR_BLOCK_SIZE_HIGH 0x11U

#define AP6256_BCM_CONTROL_F1_BLOCK_SIZE    64U
#define AP6256_BCM_CONTROL_F2_BLOCK_SIZE    512U
#define AP6256_BCM_CHIPCOMMON_BASE          0x18000000UL
#define AP6256_BCM_CHIP_CLOCK_CSR           0x1000EU
#define AP6256_BCM_CHIP_CLOCK_FORCE_ALP     0x01U
#define AP6256_BCM_CHIP_CLOCK_ALP_AVAIL     0x40U

#define AP6256_BCM_SBADDRLOW        0x1000AU
#define AP6256_BCM_SBADDRMID        0x1000BU
#define AP6256_BCM_SBADDRHIGH       0x1000CU
#define AP6256_BCM_SBWINDOW_MASK    0xFFFF8000UL
#define AP6256_BCM_SB_OFT_ADDR_MASK 0x00007FFFUL
#define AP6256_BCM_BACKPLANE_32BIT_ACCESS 0x08000UL

typedef enum {
    SDMMC_RESP_NONE = 0U,
    SDMMC_RESP_SHORT = 1U,
    SDMMC_RESP_LONG = 3U
} sdmmc_resp_t;

static ap6256_status_t ap6256_bt_wait_cmd_complete(uint16_t opcode,
                                                   uint8_t *status_out,
                                                   uint8_t *ret_params,
                                                   uint8_t *ret_len,
                                                   uint32_t timeout_ms,
                                                   uint32_t *frames_seen);
static ap6256_status_t ap6256_sdio_cmd52_write(uint8_t function, uint32_t address, uint8_t value);
static void ap6256_sdio_session_reset(void);
static ap6256_status_t ap6256_bt_send_hci_cmd(const uint8_t *cmd, uint16_t len);
static uint32_t ap6256_sdmmc_block_size_code(uint32_t block_size);
static ap6256_status_t ap6256_sdio_cmd53_transfer(uint8_t write,
                                                  uint8_t function,
                                                  uint32_t address,
                                                  uint8_t *data,
                                                  uint32_t len,
                                                  uint8_t block_mode,
                                                  uint8_t op_code);

static uint8_t s_ap6256_sdio_open = 0U;
static uint16_t s_ap6256_sdio_rca = 0U;
static uint32_t s_ap6256_sb_window = 0xFFFFFFFFUL;
static uint8_t s_ap6256_bt_open = 0U;

static void ap6256_sdmmc1_set_clock(uint16_t div)
{
    uint32_t clkcr = ((uint32_t)div & SDMMC_CLKCR_CLKDIV);
    SDMMC1->CLKCR = clkcr;
}

static ap6256_status_t ap6256_sdmmc1_send_cmd(uint32_t cmd_idx,
                                              uint32_t arg,
                                              sdmmc_resp_t waitresp,
                                              uint8_t ignore_crc_fail,
                                              uint32_t *response)
{
    uint32_t start = HAL_GetTick();
    uint32_t status;
    uint32_t cmd = SDMMC_CMD_CPSMEN | (cmd_idx & 0x3FU);

    if (waitresp == SDMMC_RESP_SHORT) {
        cmd |= SDMMC_CMD_WAITRESP_0;
    } else if (waitresp == SDMMC_RESP_LONG) {
        cmd |= SDMMC_CMD_WAITRESP_0 | SDMMC_CMD_WAITRESP_1;
    }

    SDMMC1->ICR = 0xFFFFFFFFU;
    SDMMC1->ARG = arg;
    SDMMC1->CMD = cmd;

    while (1) {
        status = SDMMC1->STA;

        if (waitresp == SDMMC_RESP_NONE) {
            if ((status & SDMMC_STA_CMDSENT) != 0U) {
                break;
            }
        } else {
            if ((status & SDMMC_STA_CMDREND) != 0U) {
                break;
            }
            if ((status & SDMMC_STA_CCRCFAIL) != 0U) {
                if (ignore_crc_fail != 0U) {
                    break;
                }
                SDMMC1->ICR = 0xFFFFFFFFU;
                return AP6256_STATUS_PROTOCOL_ERROR;
            }
        }

        if ((status & SDMMC_STA_CTIMEOUT) != 0U) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_TIMEOUT;
        }

        if ((HAL_GetTick() - start) > AP6256_SDIO_CMD_TIMEOUT) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_TIMEOUT;
        }
    }

    if (response != NULL) {
        *response = SDMMC1->RESP1;
    }

    SDMMC1->ICR = 0xFFFFFFFFU;
    return AP6256_STATUS_OK;
}

static void ap6256_sdmmc1_prepare(void)
{
    __HAL_RCC_SDMMC1_CLK_ENABLE();
    __HAL_RCC_SDMMC1_FORCE_RESET();
    __HAL_RCC_SDMMC1_RELEASE_RESET();

    SDMMC1->POWER = 0x3U;
    ap6256_sdmmc1_set_clock(250U);
    HAL_Delay(2U);
}

static ap6256_status_t ap6256_sdio_cmd52_read(uint8_t function, uint32_t address, uint8_t *value_out)
{
    uint32_t arg = 0U;
    uint32_t resp = 0U;
    ap6256_status_t st;

    if (value_out == NULL) {
        return AP6256_STATUS_BAD_PARAM;
    }

    arg |= ((uint32_t)function & 0x07U) << 28U;
    arg |= (address & 0x1FFFFU) << 9U;

    /*
     * On this board/AP6256 path, CMD52 can raise CCRCFAIL while still returning
     * a usable R5 response. Keep behavior aligned with previous proven probe logic.
     */
    st = ap6256_sdmmc1_send_cmd(52U, arg, SDMMC_RESP_SHORT, 1U, &resp);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    /* R5 response lower byte contains read data. */
    *value_out = (uint8_t)(resp & 0xFFU);
    return AP6256_STATUS_OK;
}

static ap6256_status_t ap6256_sdio_cmd52_write(uint8_t function, uint32_t address, uint8_t value)
{
    uint32_t arg = 0U;

    arg |= 0x80000000UL;
    arg |= ((uint32_t)function & 0x07U) << 28U;
    arg |= (address & 0x1FFFFU) << 9U;
    arg |= value;

    return ap6256_sdmmc1_send_cmd(52U, arg, SDMMC_RESP_SHORT, 1U, NULL);
}

