CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
static uint32_t ap6256_sdmmc_block_size_code(uint32_t block_size)
{
    switch (block_size) {
    case 1U:   return SDMMC_DATABLOCK_SIZE_1B;
    case 2U:   return SDMMC_DATABLOCK_SIZE_2B;
    case 4U:   return SDMMC_DATABLOCK_SIZE_4B;
    case 8U:   return SDMMC_DATABLOCK_SIZE_8B;
    case 16U:  return SDMMC_DATABLOCK_SIZE_16B;
    case 32U:  return SDMMC_DATABLOCK_SIZE_32B;
    case 64U:  return SDMMC_DATABLOCK_SIZE_64B;
    case 128U: return SDMMC_DATABLOCK_SIZE_128B;
    case 256U: return SDMMC_DATABLOCK_SIZE_256B;
    case 512U: return SDMMC_DATABLOCK_SIZE_512B;
    case 1024U: return SDMMC_DATABLOCK_SIZE_1024B;
    case 2048U: return SDMMC_DATABLOCK_SIZE_2048B;
    case 4096U: return SDMMC_DATABLOCK_SIZE_4096B;
    case 8192U: return SDMMC_DATABLOCK_SIZE_8192B;
    case 16384U: return SDMMC_DATABLOCK_SIZE_16384B;
    default:
        return SDMMC_DATABLOCK_SIZE_1B;
    }
}

static ap6256_status_t ap6256_sdio_cmd53_transfer(uint8_t write,
                                                  uint8_t function,
                                                  uint32_t address,
                                                  uint8_t *data,
                                                  uint32_t len,
                                                  uint8_t block_mode,
                                                  uint8_t op_code)
{
    SDMMC_DataInitTypeDef data_cfg;
    uint32_t arg = 0U;
    uint32_t count = 0U;
    uint32_t block_size = 1U;
    uint32_t start = HAL_GetTick();
    uint32_t offset = 0U;

    if ((data == NULL) || (len == 0U) || (s_ap6256_sdio_open == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    if (block_mode != 0U) {
        if (function == 1U) {
            block_size = AP6256_BCM_CONTROL_F1_BLOCK_SIZE;
        } else if (function == 2U) {
            block_size = AP6256_BCM_CONTROL_F2_BLOCK_SIZE;
        } else {
            block_size = 64U;
        }

        if ((len % block_size) != 0U) {
            return AP6256_STATUS_BAD_PARAM;
        }
        count = len / block_size;
    } else {
        count = (len == 512U) ? 0U : len;
        block_size = 1U;
    }

    memset(&data_cfg, 0, sizeof(data_cfg));
    data_cfg.DataTimeOut = SDMMC_DATATIMEOUT;
    data_cfg.DataLength = len;
    data_cfg.DataBlockSize = ap6256_sdmmc_block_size_code(block_size);
    data_cfg.TransferDir = (write != 0U) ? SDMMC_TRANSFER_DIR_TO_CARD : SDMMC_TRANSFER_DIR_TO_SDMMC;
    data_cfg.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
    data_cfg.DPSM = SDMMC_DPSM_ENABLE;

    SDMMC1->ICR = 0xFFFFFFFFU;
    if (SDMMC_ConfigData(SDMMC1, &data_cfg) != HAL_OK) {
        return AP6256_STATUS_IO_ERROR;
    }

    arg |= ((uint32_t)(write != 0U) << 31U);
    arg |= ((uint32_t)function & 0x07U) << 28U;
    arg |= ((uint32_t)(block_mode != 0U) << 27U);
    arg |= ((uint32_t)(op_code != 0U) << 26U);
    arg |= (address & 0x1FFFFUL) << 9U;
    arg |= (count & 0x1FFU);

    if (SDMMC_SDIO_CmdReadWriteExtended(SDMMC1, arg) != SDMMC_ERROR_NONE) {
        SDMMC1->ICR = 0xFFFFFFFFU;
        return AP6256_STATUS_PROTOCOL_ERROR;
    }

    while ((HAL_GetTick() - start) < AP6256_SDIO_DATA_TIMEOUT_MS) {
        uint32_t sta = SDMMC1->STA;

        if ((sta & (SDMMC_STA_DTIMEOUT | SDMMC_STA_DCRCFAIL | SDMMC_STA_RXOVERR | SDMMC_STA_TXUNDERR)) != 0U) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_IO_ERROR;
        }

        if (write == 0U) {
            while ((((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0U) ||
                    (((SDMMC1->STA & SDMMC_STA_DATAEND) != 0U) &&
                     ((SDMMC1->STA & SDMMC_STA_RXFIFOE) == 0U))) &&
                   (offset < len)) {
                uint32_t word = SDMMC_ReadFIFO(SDMMC1);
                uint32_t i;

                for (i = 0U; (i < 4U) && (offset < len); ++i) {
                    data[offset++] = (uint8_t)((word >> (8U * i)) & 0xFFU);
                }
            }
        } else {
            while (((SDMMC1->STA & SDMMC_STA_TXFIFOHE) != 0U) && (offset < len)) {
                uint32_t word = 0U;
                uint32_t i;

                for (i = 0U; (i < 4U) && (offset < len); ++i) {
                    word |= ((uint32_t)data[offset++]) << (8U * i);
                }

                if (SDMMC_WriteFIFO(SDMMC1, &word) != HAL_OK) {
                    SDMMC1->ICR = 0xFFFFFFFFU;
                    return AP6256_STATUS_IO_ERROR;
                }
            }
        }

        if (((sta & SDMMC_STA_DATAEND) != 0U) && (offset >= len)) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_OK;
        }
    }

    SDMMC1->ICR = 0xFFFFFFFFU;
    return AP6256_STATUS_TIMEOUT;
}

static ap6256_status_t ap6256_sdio_cmd52_read_retry(uint8_t function,
                                                     uint32_t address,
                                                     uint8_t *value_out,
                                                     uint8_t retries)
{
    ap6256_status_t st = AP6256_STATUS_TIMEOUT;
    uint8_t i;

    if (retries == 0U) {
        retries = 1U;
    }

    for (i = 0U; i < retries; ++i) {
        st = ap6256_sdio_cmd52_read(function, address, value_out);
        if (st == AP6256_STATUS_OK) {
            return AP6256_STATUS_OK;
        }
        HAL_Delay(2U);
    }

    return st;
}

static void ap6256_sdio_session_reset(void)
{
    s_ap6256_sdio_open = 0U;
    s_ap6256_sdio_rca = 0U;
    s_ap6256_sb_window = 0xFFFFFFFFUL;
}

static ap6256_status_t ap6256_sdio_cmd52_read_retry_count(uint8_t function,
                                                           uint32_t address,
                                                           uint8_t *value_out,
                                                           uint8_t retries,
                                                           uint8_t *attempts_out)
{
    ap6256_status_t st = AP6256_STATUS_TIMEOUT;
    uint8_t i;

    if (attempts_out != NULL) {
        *attempts_out = 0U;
    }

    if (retries == 0U) {
        retries = 1U;
    }

    for (i = 0U; i < retries; ++i) {
        st = ap6256_sdio_cmd52_read(function, address, value_out);
        if (attempts_out != NULL) {
            *attempts_out = (uint8_t)(i + 1U);
        }
        if (st == AP6256_STATUS_OK) {
            return AP6256_STATUS_OK;
        }
        HAL_Delay(2U);
    }

    return st;
}

static void ap6256_bt_prepare_flow_control(void)
{
    GPIO_InitTypeDef gpio;

