CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
    memset(&gpio, 0, sizeof(gpio));

    /*
     * PD12 is USART3_RTS net to module UART_CTS_N.
     * Drive active-low during probe so module is clear-to-send HCI events.
     */
    gpio.Pin = GPIO_PIN_12;
    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &gpio);
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET);

    /* PD11 (module UART_RTS_N) sampled as input while flow control is forced. */
    gpio.Pin = GPIO_PIN_11;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOD, &gpio);
}

static void ap6256_bt_restore_flow_control(void)
{
    GPIO_InitTypeDef gpio;

    memset(&gpio, 0, sizeof(gpio));
    gpio.Pin = GPIO_PIN_11 | GPIO_PIN_12;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(GPIOD, &gpio);
}

static ap6256_status_t ap6256_bt_hci_probe_once(uint8_t wl_on, ap6256_bt_diag_t *diag)
{
    static const uint8_t cmd_reset[] = { 0x01U, 0x03U, 0x0CU, 0x00U };
    static const uint8_t cmd_read_ver[] = { 0x01U, 0x01U, 0x10U, 0x00U };
    uint8_t rp[32];
    uint8_t rp_len = 0U;
    ap6256_status_t st = AP6256_STATUS_OK;

    if (diag == NULL) {
        return AP6256_STATUS_BAD_PARAM;
    }

    memset(diag, 0, sizeof(*diag));

    ap6256_power_down();
    HAL_Delay(20U);
    ap6256_bt_prepare_flow_control();
    ap6256_set_enables((wl_on != 0U) ? 1U : 0U, 1U);
    diag->wl_reg_on = (wl_on != 0U) ? 1U : 0U;
    diag->bt_reg_on = 1U;
    HAL_Delay(AP6256_POWER_SETTLE_MS);

    test_uart_flush_rx();

    st = ap6256_bt_send_hci_cmd(cmd_reset, sizeof(cmd_reset));
    if (st != AP6256_STATUS_OK) {
        goto exit;
    }

    st = ap6256_bt_wait_cmd_complete(0x0C03U,
                                     &diag->reset_status,
                                     rp,
                                     &rp_len,
                                     AP6256_BT_EVENT_TIMEOUT,
                                     &diag->event_frames_seen);
    if (st != AP6256_STATUS_OK) {
        goto exit;
    }
    diag->reset_event_seen = 1U;

    st = ap6256_bt_send_hci_cmd(cmd_read_ver, sizeof(cmd_read_ver));
    if (st != AP6256_STATUS_OK) {
        goto exit;
    }

    st = ap6256_bt_wait_cmd_complete(0x1001U,
                                     &diag->version_status,
                                     rp,
                                     &rp_len,
                                     AP6256_BT_EVENT_TIMEOUT,
                                     &diag->event_frames_seen);
    if (st != AP6256_STATUS_OK) {
        goto exit;
    }
    diag->version_event_seen = 1U;

    if (rp_len >= 9U) {
        diag->hci_version = rp[1];
        diag->hci_revision = (uint16_t)rp[2] | ((uint16_t)rp[3] << 8U);
        diag->lmp_version = rp[4];
        diag->manufacturer = (uint16_t)rp[5] | ((uint16_t)rp[6] << 8U);
        diag->lmp_subversion = (uint16_t)rp[7] | ((uint16_t)rp[8] << 8U);
    }

exit:
    ap6256_power_down();
    ap6256_bt_restore_flow_control();
    return st;
}

static uint8_t ap6256_uart_read_byte(uint8_t *byte_out, uint32_t timeout_ms)
{
    if (byte_out == NULL) {
        return 0U;
    }

    return (ap6256_bt_uart_read(byte_out, 1U, timeout_ms) == AP6256_STATUS_OK) ? 1U : 0U;
}

static ap6256_status_t ap6256_bt_wait_cmd_complete(uint16_t opcode,
                                                   uint8_t *status_out,
                                                   uint8_t *ret_params,
                                                   uint8_t *ret_len,
                                                   uint32_t timeout_ms,
                                                   uint32_t *frames_seen)
{
    uint32_t start = HAL_GetTick();
    uint8_t pkt_type;

    if ((status_out == NULL) || (frames_seen == NULL)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    while ((HAL_GetTick() - start) < timeout_ms) {
        uint8_t event_code;
        uint8_t param_len;
        uint8_t payload[64];
        uint8_t i;

        if (ap6256_uart_read_byte(&pkt_type, 15U) == 0U) {
            continue;
        }

        if (pkt_type != 0x04U) {
            continue;
        }

        if ((ap6256_uart_read_byte(&event_code, 20U) == 0U) ||
            (ap6256_uart_read_byte(&param_len, 20U) == 0U)) {
            continue;
        }

        if (param_len > sizeof(payload)) {
            for (i = 0U; i < param_len; ++i) {
                uint8_t throwaway;
                if (ap6256_uart_read_byte(&throwaway, 10U) == 0U) {
                    break;
                }
            }
            continue;
        }

        for (i = 0U; i < param_len; ++i) {
            if (ap6256_uart_read_byte(&payload[i], 20U) == 0U) {
                break;
            }
        }
        if (i != param_len) {
            continue;
        }

        (*frames_seen)++;

        if ((event_code != 0x0EU) || (param_len < 4U)) {
            continue;
        }

        if (((uint16_t)payload[1] | ((uint16_t)payload[2] << 8U)) != opcode) {
            continue;
        }

        *status_out = payload[3];

        if ((ret_params != NULL) && (ret_len != NULL)) {
            uint8_t rp_len = (param_len > 3U) ? (uint8_t)(param_len - 3U) : 0U;
            uint8_t copy = rp_len;
            if (copy > 32U) {
                copy = 32U;
            }
            if (copy > 0U) {
                memcpy(ret_params, &payload[3], copy);
            }
            *ret_len = rp_len;
        }

        return AP6256_STATUS_OK;
    }

    return AP6256_STATUS_TIMEOUT;
}

static ap6256_status_t ap6256_bt_send_hci_cmd(const uint8_t *cmd, uint16_t len)
{
    return ap6256_bt_uart_write(cmd, len);
}

void ap6256_init(void)
{
    ap6256_power_down();
}

void ap6256_set_enables(uint8_t wl_on, uint8_t bt_on)
{
    HAL_GPIO_WritePin(AP6256_WL_ENABLE_PORT, AP6256_WL_ENABLE_PIN, (wl_on != 0U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
    HAL_GPIO_WritePin(AP6256_BT_ENABLE_PORT, AP6256_BT_ENABLE_PIN, (bt_on != 0U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

