CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
void ap6256_power_down(void)
{
    ap6256_set_enables(0U, 0U);
    ap6256_sdio_session_reset();
    s_ap6256_bt_open = 0U;
}

ap6256_status_t ap6256_sdio_open(ap6256_sdio_session_t *session, uint8_t wl_on, uint8_t bt_on)
{
    uint32_t resp = 0U;
    uint32_t rca_resp = 0U;
    uint32_t start;
    ap6256_status_t st;

    if ((session == NULL) || (wl_on == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    memset(session, 0, sizeof(*session));

    ap6256_power_down();
    HAL_Delay(20U);
    ap6256_sdmmc1_prepare();
    ap6256_set_enables(1U, (bt_on != 0U) ? 1U : 0U);
    HAL_Delay(AP6256_POWER_SETTLE_MS);

    session->wl_reg_on = 1U;
    session->bt_reg_on = (bt_on != 0U) ? 1U : 0U;

    if (HAL_GPIO_ReadPin(AP6256_WL_ENABLE_PORT, AP6256_WL_ENABLE_PIN) != GPIO_PIN_SET) {
        ap6256_power_down();
        return AP6256_STATUS_IO_ERROR;
    }

    st = ap6256_sdmmc1_send_cmd(0U, 0U, SDMMC_RESP_NONE, 1U, NULL);
    if (st != AP6256_STATUS_OK) {
        ap6256_power_down();
        return st;
    }

    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < AP6256_SDIO_READY_TIMEOUT) {
        st = ap6256_sdmmc1_send_cmd(5U, 0x00300000U, SDMMC_RESP_SHORT, 1U, &resp);
        if (st != AP6256_STATUS_OK) {
            ap6256_power_down();
            return st;
        }

        if ((resp & 0x80000000UL) != 0U) {
            session->cmd5_ready = 1U;
            session->ocr = resp;
            break;
        }

        HAL_Delay(5U);
    }

    if (session->cmd5_ready == 0U) {
        ap6256_power_down();
        return AP6256_STATUS_TIMEOUT;
    }

    st = ap6256_sdmmc1_send_cmd(3U, 0U, SDMMC_RESP_SHORT, 1U, &rca_resp);
    if (st != AP6256_STATUS_OK) {
        ap6256_power_down();
        return st;
    }

    session->rca = (uint16_t)((rca_resp >> 16U) & 0xFFFFU);
    if (session->rca == 0U) {
        ap6256_power_down();
        return AP6256_STATUS_PROTOCOL_ERROR;
    }

    st = ap6256_sdmmc1_send_cmd(7U,
                                ((uint32_t)session->rca << 16U),
                                SDMMC_RESP_SHORT,
                                1U,
                                NULL);
    if (st != AP6256_STATUS_OK) {
        ap6256_power_down();
        return st;
    }

    session->selected = 1U;
    s_ap6256_sdio_open = 1U;
    s_ap6256_sdio_rca = session->rca;
    s_ap6256_sb_window = 0xFFFFFFFFUL;
    return AP6256_STATUS_OK;
}

void ap6256_sdio_close(void)
{
    ap6256_power_down();
}

ap6256_status_t ap6256_sdio_cmd52_read_u8(uint8_t function, uint32_t address, uint8_t *value_out)
{
    return ap6256_sdio_cmd52_read(function, address, value_out);
}

ap6256_status_t ap6256_sdio_cmd52_write_u8(uint8_t function, uint32_t address, uint8_t value)
{
    return ap6256_sdio_cmd52_write(function, address, value);
}

ap6256_status_t ap6256_sdio_cmd53_read(uint8_t function,
                                       uint32_t address,
                                       uint8_t *data,
                                       uint32_t len,
                                       uint8_t block_mode,
                                       uint8_t op_code)
{
    return ap6256_sdio_cmd53_transfer(0U, function, address, data, len, block_mode, op_code);
}

ap6256_status_t ap6256_sdio_cmd53_write(uint8_t function,
                                        uint32_t address,
                                        const uint8_t *data,
                                        uint32_t len,
                                        uint8_t block_mode,
                                        uint8_t op_code)
{
    return ap6256_sdio_cmd53_transfer(1U, function, address, (uint8_t *)data, len, block_mode, op_code);
}

ap6256_status_t ap6256_sdio_enable_function(uint8_t function)
{
    uint8_t io_enable = 0U;
    uint8_t io_ready = 0U;
    uint8_t bit;
    uint32_t start;
    ap6256_status_t st;

    if ((function == 0U) || (function > 7U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    bit = (uint8_t)(1U << function);

    st = ap6256_sdio_cmd52_read_u8(0U, AP6256_SDIO_CCCR_IO_ENABLE, &io_enable);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    io_enable |= bit;
    st = ap6256_sdio_cmd52_write_u8(0U, AP6256_SDIO_CCCR_IO_ENABLE, io_enable);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < AP6256_SDIO_FUNC_READY_TIMEOUT) {
        st = ap6256_sdio_cmd52_read_u8(0U, AP6256_SDIO_CCCR_IO_READY, &io_ready);
        if ((st == AP6256_STATUS_OK) && ((io_ready & bit) != 0U)) {
            return AP6256_STATUS_OK;
        }
        HAL_Delay(1U);
    }

    return AP6256_STATUS_TIMEOUT;
}

ap6256_status_t ap6256_sdio_set_block_size(uint8_t function, uint16_t block_size)
{
    uint32_t base;
    ap6256_status_t st;

    if (block_size == 0U) {
        return AP6256_STATUS_BAD_PARAM;
    }

    base = (function == 0U) ? AP6256_SDIO_FBR_BLOCK_SIZE_LOW
                            : (((uint32_t)function * AP6256_SDIO_FBR_STRIDE) + AP6256_SDIO_FBR_BLOCK_SIZE_LOW);

    st = ap6256_sdio_cmd52_write_u8(0U, base, (uint8_t)(block_size & 0xFFU));
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    return ap6256_sdio_cmd52_write_u8(0U, base + 1U, (uint8_t)((block_size >> 8U) & 0xFFU));
}

ap6256_status_t ap6256_bcm_prepare_control_bus(uint8_t *chip_clock_csr_out)
{
    uint8_t chip_clock_csr = 0U;
    uint32_t start;
    ap6256_status_t st;

    st = ap6256_sdio_enable_function(1U);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_sdio_set_block_size(1U, AP6256_BCM_CONTROL_F1_BLOCK_SIZE);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_sdio_enable_function(2U);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_sdio_set_block_size(2U, AP6256_BCM_CONTROL_F2_BLOCK_SIZE);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_sdio_cmd52_read_u8(1U, AP6256_BCM_CHIP_CLOCK_CSR, &chip_clock_csr);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    chip_clock_csr |= AP6256_BCM_CHIP_CLOCK_FORCE_ALP;
    st = ap6256_sdio_cmd52_write_u8(1U, AP6256_BCM_CHIP_CLOCK_CSR, chip_clock_csr);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < AP6256_SDIO_FUNC_READY_TIMEOUT) {
        st = ap6256_sdio_cmd52_read_u8(1U, AP6256_BCM_CHIP_CLOCK_CSR, &chip_clock_csr);
        if ((st == AP6256_STATUS_OK) &&
            ((chip_clock_csr & AP6256_BCM_CHIP_CLOCK_ALP_AVAIL) != 0U)) {
            if (chip_clock_csr_out != NULL) {
                *chip_clock_csr_out = chip_clock_csr;
            }
            return AP6256_STATUS_OK;
        }
        HAL_Delay(1U);
    }

    if (chip_clock_csr_out != NULL) {
        *chip_clock_csr_out = chip_clock_csr;
    }

    return AP6256_STATUS_TIMEOUT;
}

ap6256_status_t ap6256_bcm_set_backplane_window(uint32_t address)
{
    uint32_t bar0;
    uint32_t value;
    uint8_t i;
    ap6256_status_t st;

    bar0 = address & AP6256_BCM_SBWINDOW_MASK;
    if (bar0 == s_ap6256_sb_window) {
        return AP6256_STATUS_OK;
    }

    value = bar0 >> 8U;
    for (i = 0U; i < 3U; ++i, value >>= 8U) {
        st = ap6256_sdio_cmd52_write_u8(1U, AP6256_BCM_SBADDRLOW + i, (uint8_t)(value & 0xFFU));
        if (st != AP6256_STATUS_OK) {
            return st;
        }
    }

    s_ap6256_sb_window = bar0;
    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bcm_backplane_read32(uint32_t address, uint32_t *value_out)
{
    uint32_t local;
    uint8_t b0;
    uint8_t b1;
    uint8_t b2;
    uint8_t b3;
    ap6256_status_t st;

