CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
    if (value_out == NULL) {
        return AP6256_STATUS_BAD_PARAM;
    }

    st = ap6256_bcm_set_backplane_window(address);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    /* Use byte-wise F1 accesses here as a low-bandwidth control-path primitive. */
    local = address & AP6256_BCM_SB_OFT_ADDR_MASK;
    st = ap6256_sdio_cmd52_read_u8(1U, local + 0U, &b0);
    if (st != AP6256_STATUS_OK) {
        return st;
    }
    st = ap6256_sdio_cmd52_read_u8(1U, local + 1U, &b1);
    if (st != AP6256_STATUS_OK) {
        return st;
    }
    st = ap6256_sdio_cmd52_read_u8(1U, local + 2U, &b2);
    if (st != AP6256_STATUS_OK) {
        return st;
    }
    st = ap6256_sdio_cmd52_read_u8(1U, local + 3U, &b3);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    *value_out = (uint32_t)b0 |
                 ((uint32_t)b1 << 8U) |
                 ((uint32_t)b2 << 16U) |
                 ((uint32_t)b3 << 24U);
    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bcm_backplane_write32(uint32_t address, uint32_t value)
{
    uint32_t local;
    ap6256_status_t st;

    st = ap6256_bcm_set_backplane_window(address);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    /* Use byte-wise F1 accesses here as a low-bandwidth control-path primitive. */
    local = address & AP6256_BCM_SB_OFT_ADDR_MASK;
    st = ap6256_sdio_cmd52_write_u8(1U, local + 0U, (uint8_t)(value & 0xFFU));
    if (st != AP6256_STATUS_OK) {
        return st;
    }
    st = ap6256_sdio_cmd52_write_u8(1U, local + 1U, (uint8_t)((value >> 8U) & 0xFFU));
    if (st != AP6256_STATUS_OK) {
        return st;
    }
    st = ap6256_sdio_cmd52_write_u8(1U, local + 2U, (uint8_t)((value >> 16U) & 0xFFU));
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    return ap6256_sdio_cmd52_write_u8(1U, local + 3U, (uint8_t)((value >> 24U) & 0xFFU));
}

ap6256_status_t ap6256_bcm_backplane_read(uint32_t address, uint8_t *data, uint32_t len)
{
    ap6256_status_t st = AP6256_STATUS_OK;

    if ((data == NULL) || (len == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    while (len > 0U) {
        uint32_t window_remaining = (AP6256_BCM_SB_OFT_ADDR_MASK + 1U) - (address & AP6256_BCM_SB_OFT_ADDR_MASK);
        uint32_t chunk = (len < window_remaining) ? len : window_remaining;
        uint32_t local = address & AP6256_BCM_SB_OFT_ADDR_MASK;
        uint8_t block_mode = 0U;

        st = ap6256_bcm_set_backplane_window(address);
        if (st != AP6256_STATUS_OK) {
            return st;
        }

        if ((chunk >= AP6256_BCM_CONTROL_F1_BLOCK_SIZE) &&
            ((chunk % AP6256_BCM_CONTROL_F1_BLOCK_SIZE) == 0U)) {
            block_mode = 1U;
        }

        st = ap6256_sdio_cmd53_read(1U, local, data, chunk, block_mode, 1U);
        if (st != AP6256_STATUS_OK) {
            return st;
        }

        address += chunk;
        data += chunk;
        len -= chunk;
    }

    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bcm_backplane_write(uint32_t address, const uint8_t *data, uint32_t len)
{
    ap6256_status_t st = AP6256_STATUS_OK;

    if ((data == NULL) || (len == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    while (len > 0U) {
        uint32_t window_remaining = (AP6256_BCM_SB_OFT_ADDR_MASK + 1U) - (address & AP6256_BCM_SB_OFT_ADDR_MASK);
        uint32_t chunk = (len < window_remaining) ? len : window_remaining;
        uint32_t local = address & AP6256_BCM_SB_OFT_ADDR_MASK;
        uint8_t block_mode = 0U;

        st = ap6256_bcm_set_backplane_window(address);
        if (st != AP6256_STATUS_OK) {
            return st;
        }

        if ((chunk >= AP6256_BCM_CONTROL_F1_BLOCK_SIZE) &&
            ((chunk % AP6256_BCM_CONTROL_F1_BLOCK_SIZE) == 0U)) {
            block_mode = 1U;
        }

        st = ap6256_sdio_cmd53_write(1U, local, data, chunk, block_mode, 1U);
        if (st != AP6256_STATUS_OK) {
            return st;
        }

        address += chunk;
        data += chunk;
        len -= chunk;
    }

    return AP6256_STATUS_OK;
}

uint16_t ap6256_bcm_chip_id_from_raw(uint32_t chip_id_raw)
{
    return (uint16_t)(chip_id_raw & 0xFFFFU);
}

ap6256_status_t ap6256_bt_uart_write(const uint8_t *data, uint16_t len)
{
    if ((data == NULL) || (len == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    if (HAL_UART_Transmit(&huart3, (uint8_t *)data, len, 200U) != HAL_OK) {
        return AP6256_STATUS_IO_ERROR;
    }

    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bt_uart_read(uint8_t *data, uint16_t len, uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    uint16_t offset = 0U;

    if ((data == NULL) || (len == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    while (offset < len) {
        uint32_t elapsed = HAL_GetTick() - start;
        uint32_t remaining = (elapsed >= timeout_ms) ? 0U : (timeout_ms - elapsed);

        if (remaining == 0U) {
            return AP6256_STATUS_TIMEOUT;
        }

        if (HAL_UART_Receive(&huart3, &data[offset], 1U, (remaining > 10U) ? 10U : remaining) == HAL_OK) {
            offset++;
        }
    }

    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bt_open(uint8_t wl_on)
{
    ap6256_power_down();
    HAL_Delay(20U);
    ap6256_bt_prepare_flow_control();
    ap6256_set_enables((wl_on != 0U) ? 1U : 0U, 1U);
    HAL_Delay(AP6256_POWER_SETTLE_MS);
    test_uart_flush_rx();
    s_ap6256_bt_open = 1U;
    return AP6256_STATUS_OK;
}

void ap6256_bt_close(void)
{
    ap6256_power_down();
    ap6256_bt_restore_flow_control();
}

ap6256_status_t ap6256_bt_hci_command(uint16_t opcode,
                                      const uint8_t *params,
                                      uint8_t params_len,
                                      uint8_t *ret_params,
                                      uint8_t *ret_len)
{
    uint8_t buffer[260];
    uint8_t status = 0xFFU;
    uint32_t frames_seen = 0U;
    ap6256_status_t st;

    if (params_len > (sizeof(buffer) - 4U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

    buffer[0] = 0x01U;
    buffer[1] = (uint8_t)(opcode & 0xFFU);
    buffer[2] = (uint8_t)((opcode >> 8U) & 0xFFU);
    buffer[3] = params_len;
    if ((params != NULL) && (params_len > 0U)) {
        memcpy(&buffer[4], params, params_len);
    }

    st = ap6256_bt_send_hci_cmd(buffer, (uint16_t)(params_len + 4U));
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_bt_wait_cmd_complete(opcode,
                                     &status,
                                     ret_params,
                                     ret_len,
                                     AP6256_BT_EVENT_TIMEOUT,
                                     &frames_seen);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    return (status == 0x00U) ? AP6256_STATUS_OK : AP6256_STATUS_PROTOCOL_ERROR;
}

ap6256_status_t ap6256_bt_patchram_download(void)
{
    const ap6256_embedded_asset_t *asset = ap6256_assets_bt_patchram();
    uint32_t offset = 0U;
    uint8_t ret_params[32];
    uint8_t ret_len = 0U;
    ap6256_status_t st;

    if ((asset == NULL) || (asset->data == NULL) || (asset->size == 0U)) {
        return AP6256_STATUS_BAD_PARAM;
    }

