CircuitSetup/stm32h7_test_program/src/ap6256_driver.c
    st = ap6256_bt_hci_command(0xFC2EU, NULL, 0U, ret_params, &ret_len);
    if (st != AP6256_STATUS_OK) {
        return st;
    }

    while (offset < asset->size) {
        uint16_t opcode;
        uint8_t params_len;

        if ((offset + 3U) > asset->size) {
            return AP6256_STATUS_PROTOCOL_ERROR;
        }

        opcode = (uint16_t)asset->data[offset] | ((uint16_t)asset->data[offset + 1U] << 8U);
        params_len = asset->data[offset + 2U];
        offset += 3U;

        if ((offset + params_len) > asset->size) {
            return AP6256_STATUS_PROTOCOL_ERROR;
        }

        st = ap6256_bt_hci_command(opcode,
                                   &asset->data[offset],
                                   params_len,
                                   ret_params,
                                   &ret_len);
        if (st != AP6256_STATUS_OK) {
            return st;
        }

        offset += params_len;
    }

    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_wifi_transport_probe(ap6256_wifi_diag_t *diag)
{
    ap6256_sdio_session_t session;
    uint8_t cccr = 0xFFU;
    uint8_t sdio_rev = 0xFFU;
    uint8_t io_enable = 0xFFU;
    uint8_t io_ready = 0xFFU;
    uint8_t cis_low = 0xFFU;
    uint8_t cis_mid = 0xFFU;
    uint8_t cis_high = 0xFFU;
    uint8_t chip_clock_csr = 0x00U;
    uint32_t start;
    uint32_t chip_id_raw = 0U;
    ap6256_status_t st;

    if (diag == NULL) {
        return AP6256_STATUS_BAD_PARAM;
    }

    memset(diag, 0, sizeof(*diag));
    diag->cccr_rev = 0xFFU;
    diag->sdio_rev = 0xFFU;
    diag->io_enable = 0xFFU;
    diag->io_ready = 0xFFU;
    diag->cis_ptr = 0x00FFFFFFUL;
    diag->function1_block_size = AP6256_BCM_CONTROL_F1_BLOCK_SIZE;
    diag->function2_block_size = AP6256_BCM_CONTROL_F2_BLOCK_SIZE;

    ap6256_power_down();
    HAL_Delay(20U);
    ap6256_sdmmc1_prepare();

    /* Sanity check while disabled: CMD5 should usually not return ready response. */
    if (ap6256_sdmmc1_send_cmd(5U, 0U, SDMMC_RESP_SHORT, 1U, &start) == AP6256_STATUS_OK) {
        diag->disabled_cmd5_response = 1U;
    }

    st = ap6256_sdio_open(&session, 1U, 0U);
    if (st != AP6256_STATUS_OK) {
        ap6256_sdio_close();
        return st;
    }

    diag->wl_reg_on = session.wl_reg_on;
    diag->bt_reg_on = session.bt_reg_on;
    diag->wl_pin_level = (HAL_GPIO_ReadPin(AP6256_WL_ENABLE_PORT, AP6256_WL_ENABLE_PIN) == GPIO_PIN_SET) ? 1U : 0U;
    diag->bt_pin_level = (HAL_GPIO_ReadPin(AP6256_BT_ENABLE_PORT, AP6256_BT_ENABLE_PIN) == GPIO_PIN_SET) ? 1U : 0U;
    diag->cmd5_ready = session.cmd5_ready;
    diag->cmd5_attempts = 1U;
    diag->ocr = session.ocr;
    diag->cmd3_ok = 1U;
    diag->cmd7_ok = (session.selected != 0U) ? 1U : 0U;
    diag->rca = session.rca;

    HAL_Delay(5U);

    /* Required for PASS: at least one valid CCCR read over CMD52. */
    if (ap6256_sdio_cmd52_read_retry_count(0U, 0x00U, &cccr, AP6256_CMD52_RETRIES, &diag->cccr_read_attempts) != AP6256_STATUS_OK) {
        ap6256_sdio_close();
        return AP6256_STATUS_PROTOCOL_ERROR;
    }
    diag->cccr_read_ok = 1U;

    /* Optional diagnostics: do not fail probe if a non-critical CMD52 read misses. */
    (void)ap6256_sdio_cmd52_read_retry(0U, AP6256_SDIO_CCCR_SDIO_REV, &sdio_rev, 2U);
    (void)ap6256_sdio_cmd52_read_retry(0U, AP6256_SDIO_CCCR_IO_ENABLE, &io_enable, 2U);
    (void)ap6256_sdio_cmd52_read_retry(0U, AP6256_SDIO_CCCR_IO_READY, &io_ready, 2U);
    (void)ap6256_sdio_cmd52_read_retry(0U, 0x09U, &cis_low, 2U);
    (void)ap6256_sdio_cmd52_read_retry(0U, 0x0AU, &cis_mid, 2U);
    (void)ap6256_sdio_cmd52_read_retry(0U, 0x0BU, &cis_high, 2U);

    diag->cccr_rev = cccr;
    diag->sdio_rev = sdio_rev;
    diag->io_enable = io_enable;
    diag->io_ready = io_ready;
    diag->cis_ptr = ((uint32_t)cis_high << 16U) | ((uint32_t)cis_mid << 8U) | cis_low;

    if (ap6256_bcm_prepare_control_bus(&chip_clock_csr) == AP6256_STATUS_OK) {
        diag->function1_ready = 1U;
        diag->function2_ready = 1U;
        diag->chip_clock_csr = chip_clock_csr;
        if (ap6256_bcm_backplane_read32(AP6256_BCM_CHIPCOMMON_BASE, &chip_id_raw) == AP6256_STATUS_OK) {
            diag->chip_id_raw = chip_id_raw;
        }
    }

    ap6256_sdio_close();
    return AP6256_STATUS_OK;
}

ap6256_status_t ap6256_bt_hci_probe(ap6256_bt_diag_t *diag)
{
    ap6256_bt_diag_t attempt;
    ap6256_status_t st;

    if (diag == NULL) {
        return AP6256_STATUS_BAD_PARAM;
    }

    memset(diag, 0, sizeof(*diag));

    /* Primary mode: BT only; fallback: BT + WL asserted for combo-module variants. */
    st = ap6256_bt_hci_probe_once(0U, &attempt);
    *diag = attempt;
    if (st == AP6256_STATUS_OK) {
        return st;
    }

    st = ap6256_bt_hci_probe_once(1U, &attempt);
    if (attempt.event_frames_seen >= diag->event_frames_seen) {
        *diag = attempt;
    }

    return st;
}

const char *ap6256_status_to_string(ap6256_status_t status)
{
    switch (status) {
    case AP6256_STATUS_OK:
        return "ok";
    case AP6256_STATUS_TIMEOUT:
        return "timeout";
    case AP6256_STATUS_IO_ERROR:
        return "io_error";
    case AP6256_STATUS_PROTOCOL_ERROR:
        return "protocol_error";
    case AP6256_STATUS_BAD_PARAM:
        return "bad_param";
    default:
        return "unknown";
    }
}
